#  Adult Income Dataset

## Load the necessary libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from urllib.request import urlretrieve
plt.style.use('ggplot')
%matplotlib inline

## Read the adult income dataset

In [2]:
url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Wrangling-Workshop/master/Chapter04/datasets/adult_income_data.csv'
urlretrieve(url, 'adult.csv')

('adult.csv', <http.client.HTTPMessage at 0x7fdc141aac90>)

In [3]:
adult = pd.read_csv('adult.csv', na_values='?')
adult.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,Female,0,0,40,United-States,<=50K

## Create a script that read a text file

In [4]:
url = ('https://raw.githubusercontent.com/PacktWorkshops/'
'The-Data-Wrangling-Workshop/master/Chapter04/datasets/adult_income_names.txt'
)
urlretrieve(url, 'names.txt')

('names.txt', <http.client.HTTPMessage at 0x7fdc1419fb10>)

In [5]:
res = []
names = []
with open('names.txt', 'r') as f:
  for line in f.readlines():
    res.append(line.split(':')[0])
  for item in res:
    if item != '\n':
      names.append(item)

In [6]:
print(names)

['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country']

In [7]:
names = names + ['income']

In [8]:
print(names)

['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'income']

## Find the missing values

In [9]:
adult.columns = names
adult.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K

In [10]:
adult.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [11]:
adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32560 entries, 0 to 32559
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32560 non-null  int64
 1   workclass       32560 non-null  object
 2   fnlwgt          32560 non-null  int64
 3   education       32560 non-null  object
 4   education-num   32560 non-null  int64
 5   marital-status  32560 non-null  object
 6   occupation      32560 non-null  object
 7   relationship    32560 non-null  object
 8   sex             32560 non-null  object
 9   capital-gain    32560 non-null  int64
 10  capital-loss    32560 non-null  int64
 11  hours-per-week  32560 non-null  int64
 12  native-country  32560 non-null  object
 13  income          32560 non-null  object
dtypes: int64(6), object(8)
memory usage: 3.5+ MB

In [12]:
adult.shape

(32560, 14)